# Unlock Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..Unlock Method
View3D Class See Also
---
Unlocks the view. Has no effect if the view is already unlocked.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Unlock()
```

Visual Basic
---
```text
Public Sub Unlock
```

Visual C++
---
```text
public:
void Unlock()
```

# See Also
View3D Class
Autodesk.Revit.DB Namespace